Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometryException Fields
The ConnectiveGeometryException type exposes the following members.
Fields
Name | Description
OperationStatus
 Possible error statuses for geometry creation/modification commands.
Top
See Also
Reference
ConnectiveGeometryException Class
Tekla.Structures.Model Namespace